#+TAGS: Phoronix(P) Pypy(Y) Jenkins(J) CollectiveMind(C)
#+TAGS: XPFlow(C) Expo(A) Execo(B) 
#+TAGS: Spack(S) Kameleon(K)

*** Réservation
    - Dabord, la frontale :
      #+begin_src sh :session foo :results output :exports both 
      ssh fpopek@access.grid5000.fr
      #+end_src

      #+RESULTS:
      #+begin_example

      Linux access-south.grid5000.fr 3.2.0-4-amd64 #1 SMP Debian 3.2.73-2+deb7u3 x86_64
      ----- Grid'5000 - access-south.grid5000.fr -----

      Welcome to Grid'5000

      ** Connect to a site:
      ssh {grenoble,lille,luxembourg,lyon,nancy,nantes,reims,rennes}

      ** Useful links:
       - account management (password change): https://api.grid5000.fr/ui/account
       - homepage: https://www.grid5000.fr/mediawiki/index.php/Category:Portal:User
       - charter : https://www.grid5000.fr/mediawiki/index.php/Grid5000:UserCharter
       - support : https://www.grid5000.fr/mediawiki/index.php/Support

      ** Data on access.grid5000.fr :
       - your home directory on access machines (access-north and access-south)
	 is not synchronized and should not be use to store data.
       - please use ssh forwarding to send data directly to sites or
      scp files login@access.grid5000.fr:reims/ using the nfs mount point in your home

      [31m[5m
      ** Warning: 1 event in progress
      #Incident in #Sophia : hard drive failures on srv.sophia.grid5000.fr, site unavailable
      [0m[31m    https://intranet.grid5000.fr/bugzilla/show_bug.cgi?id=6967
      [0m
      Last login: Tue Jun 14 14:39:37 2016 from 129.88.54.126
#+end_example

    - Puis grenoble :
      #+begin_src sh :session foo :results output :exports both 
      ssh grenoble
      #+end_src

      #+RESULTS:
      #+begin_example
      ----- Grid'5000 - Grenoble - fgrenoble.grenoble.grid5000.fr -----

      This site has 3 clusters (see: https://api.grid5000.fr/stable/ui/visualizations/nodes.html)

      Available in queue default:
       - genepi (2008): 34 nodes (2 CPUs Intel Xeon E5420, 4 cores/CPU, 8GB RAM, 153GB HDD)
       - edel   (2008): 72 nodes (2 CPUs Intel Xeon E5520, 4 cores/CPU, 24GB RAM, 119GB SSD)
       - adonis (2010): 10 nodes (2 CPUs Intel Xeon E5520, 4 cores/CPU, 24GB RAM, 233GB HDD)

      ** Useful links:
       - account management (password change): https://api.grid5000.fr/ui/account
       - homepage: https://www.grid5000.fr/mediawiki/index.php/Category:Portal:User
       - charter : https://www.grid5000.fr/mediawiki/index.php/Grid5000:UserCharter
       - support : https://www.grid5000.fr/mediawiki/index.php/Support

      ** Others sites:
      ssh {lille,luxembourg,lyon,nancy,nantes,reims,rennes,sophia}

      Last login: Tue Jun 14 14:40:46 2016 from access-south.grid5000.fr
#+end_example

    - =oarsub -I= pour réserver une machine en mode interactif
    - Pour réserver 2 noeuds pendant 30 min :
      #+begin_src sh :session foo :results output :exports both 
      oarsub -I -l nodes=2,walltime=0:30 
      #+end_src

    - Pour réserver dans le futur
      #+begin_src sh :session foo :results output :exports both 
      oarsub -I -r '2012-12-23 16:30:00'
      #+end_src

      + =oarstat= pour voir l'historique des réservations
      + =oarstat -u= pour voir ses réservations
      + =oarstat -r <JOB_ID>= pour supprimer une réservation
    - Propriétés OAR
      #+begin_src sh :session foo :results output :exports both 
      oarsub -p "gpu='YES'"
      #+end_src

    - =oarsub -t deploy= pour déployer avec Kadeploy (/The root password
      for all Grid'5000-provided images is grid5000/)
* Vendredi 17/06
  Enregistrement d'une nouvelle image contenant Chameleon et Starpu (+
  toutes les dépendances nécessaires)

  #+begin_src sh :session foo :results output :exports both 
  ssh grenoble.g5k
  ssh digitalis
  oarsub -I -t deploy
  kadeploy3 -f $OAR_NODE_FILE -a image.env -k
  #+end_src

  Rappel de l'objectif : lancer un benchmark 
  http://starpu.gforge.inria.fr/testing/morse/trunk/morse.html

  #+begin_src sh :session foo :results output :exports both 
  export SPACK_ROOT=~/spack/
  export PATH=$SPACK_ROOT/bin:$PATH
  spack install -v chameleon@trunk~quark+simu+examples+fxt+starpu ^starpu@svn-trunk+simgrid+fxt ^simgrid@starpumpi (pour la simulationg, ne marche pas)
  #+end_src

  #+RESULTS:
  #+begin_example
  ==> Successfully installed simgrid
  Fetch: 11.83s.  Build: 45.30s.  Total: 57.12s.
  [+] /root/spack/opt/spack/linux-x86_64/gcc-4.7/simgrid-starpumpi-tosagznhajv6jgnrtesrrzuhppizpmp3
  Traceback (most recent call last):
    File "/root/spack//bin/spack", line 176, in <module>
      main()
    File "/root/spack//bin/spack", line 154, in main
      return_val = command(parser, args)
    File "/root/spack/lib/spack/spack/cmd/install.py", line 82, in install
      explicit=True)
    File "/root/spack/lib/spack/spack/package.py", line 927, in do_install
      make_jobs=make_jobs)
    File "/root/spack/lib/spack/spack/package.py", line 1051, in do_install_dependencies
      dep.package.do_install(**kwargs)
    File "/root/spack/lib/spack/spack/package.py", line 1008, in do_install
      spack.build_environment.fork(self, build_process)
    File "/root/spack/lib/spack/spack/build_environment.py", line 402, in fork
      setup_package(pkg)
    File "/root/spack/lib/spack/spack/build_environment.py", line 360, in setup_package
      dpkg.setup_dependent_package(pkg.module, spec)
    File "/root/spack/var/spack/repos/builtin/packages/simgrid/package.py", line 37, in setup_dependent_package
      if spec.satisfies('+smpi'):
  NameError: global name 'spec' is not defined
  ==> Error: Installation process had nonzero exit code.
  #+end_example

  Solution : remplacer =spec= par =dep_spec=

  #+RESULTS:
  #+begin_example
  ==> 'make' '-j16'
  Making all in src
  make[1]: Entering directory `/tmp/root/spack-stage/spack-stage-Bqd_mp/trunk/src'
  make[2]: Entering directory `/tmp/root/spack-stage/spack-stage-Bqd_mp/trunk/src'
    CC     libstarpu_1.3_la-barrier.lo
    CC     libstarpu_1.3_la-barrier_counter.lo
    CC     libstarpu_1.3_la-bitmap.lo
    CC     libstarpu_1.3_la-hash.lo
    CC     libstarpu_1.3_la-rwlock.lo
    CC     libstarpu_1.3_la-starpu_spinlock.lo
    CC     libstarpu_1.3_la-timing.lo
    CC     libstarpu_1.3_la-utils.lo
    CC     libstarpu_1.3_la-fxt.lo
    CC     libstarpu_1.3_la-thread.lo
    CC     libstarpu_1.3_la-rbtree.lo
    CC     libstarpu_1.3_la-graph.lo
    CC     libstarpu_1.3_la-jobs.lo
    CC     libstarpu_1.3_la-task.lo
    CC     libstarpu_1.3_la-task_bundle.lo
    CC     libstarpu_1.3_la-tree.lo
  common/fxt.c: In function ‘_starpu_profile_set_tracefile’:
  common/fxt.c:86:2: error: implicit declaration of function ‘vnsprintf’ [-Werror=implicit-function-declaration]
  cc1: some warnings being treated as errors
  make[2]: *** [libstarpu_1.3_la-fxt.lo] Error 1
  make[2]: *** Waiting for unfinished jobs....
  make[2]: Leaving directory `/tmp/root/spack-stage/spack-stage-Bqd_mp/trunk/src'
  make[1]: *** [all-recursive] Error 1
  make[1]: Leaving directory `/tmp/root/spack-stage/spack-stage-Bqd_mp/trunk/src'
  make: *** [all-recursive] Error 1
  #+end_example

  Solution : rajouter le flag *-posix* au compilateur C : 

  #+begin_src sh :session foo :results output :exports both 
  spack install -v chameleon@trunk~quark+simu+examples+fxt+starpu cflags=\"-posix\" ^starpu@svn-trunk+simgrid+fxt ^simgrid@starpumpi
  #+end_src

  #+RESULTS:
  #+begin_example
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:189:53: error: unknown type name ‘siginfo_t’
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c: In function ‘cmsysProcess_AddCommand’:
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:469:46: warning: incompatible implicit declaration of built-in function ‘strdup’ [enabled by default]
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c: In function ‘kwsysProcessKill’:
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:2687:16: warning: initialization makes pointer from integer without a cast [enabled by default]
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c: In function ‘kwsysProcessesAdd’:
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:2861:17: error: ‘struct sigaction’ has no member named ‘sa_sigaction’
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:2861:33: error: ‘kwsysProcessesSignalHandler’ undeclared (first use in this function)
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:2861:33: note: each undeclared identifier is reported only once for each function it appears in
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c: At top level:
  /tmp/root/spack-stage/spack-stage-NiynFP/cmake-3.5.2/Source/kwsys/ProcessUNIX.c:2950:43: error: unknown type name ‘siginfo_t’
  #+end_example

  Solution : rajouter le flag *-D_POSIX_C_SOURCE=200112L* (le flag
  -posix n'est plus nécessaire)
  http://stackoverflow.com/questions/22912674/unknown-type-name-siginfo-t-with-clang-using-posix-c-source-2-why
  
  Autre erreur de déclaration implicite (je ne vais pas toutes les noter).

  Solution : rajouter le flag *-D_GNU_SOURCE*

  #+begin_src sh :session foo :results output :exports both 
  spack install -v chameleon@trunk~quark+simu+examples+fxt+starpu cflags=\"-D_POSIX_C_SOURCE=200112L -D_GNU_SOURCE\" ^starpu@svn-trunk+simgrid+fxt ^simgrid@starpumpi
  #+end_src

  #+RESULTS:
  #+begin_example
  core/perfmodel/perfmodel_history.c: In function ‘_starpu_perfmodel_realloc’:
  core/perfmodel/perfmodel_history.c:662:2: error: ‘LONG_MAX’ undeclared (first use in this function)
  core/perfmodel/perfmodel_history.c:662:2: note: each undeclared identifier is reported only once for each function it appears in
  make[2]: *** [libstarpu_1.3_la-perfmodel_history.lo] Error 1
  make[2]: *** Waiting for unfinished jobs....
  make[2]: Leaving directory `/tmp/root/spack-stage/spack-stage-AAkAxm/trunk/src'
  make[1]: *** [all-recursive] Error 1
  make[1]: Leaving directory `/tmp/root/spack-stage/spack-stage-AAkAxm/trunk/src'
  make: *** [all-recursive] Error 1
  #+end_example

  Solution : rajouter le flag *-include limits.h*

  #+begin_src sh :session foo :results output :exports both 
  spack install -v chameleon@trunk~quark+simu+examples+fxt+starpu cflags=\"-D_POSIX_C_SOURCE=200112L -D_GNU_SOURCE -include limits.h\" ^starpu@svn-trunk+simgrid+fxt ^simgrid@starpumpi
  #+end_src

  #+RESULTS:
  #+begin_example
  CMake Error at tools/cmake/CompleteInFiles.cmake:117 (message):
  Failed to find Boost libraries.Did you install libboost-dev and
  libboost-context-dev?(libboost-context-dev is optional)
  #+end_example

